Model: "model"
_____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
 Layer (type)                                                                     Output Shape                                           Param #                       Connected to                                                                       Trainable  
=====================================================================================================================================================================================================================================================================
 decoder_inputs (InputLayer)                                                      [(None, 10, 3)]                                        0                             []                                                                                 Y          
                                                                                                                                                                                                                                                                     
 encoder_past_inputs (InputLayer)                                                 [(None, 25, 2)]                                        0                             []                                                                                 Y          
                                                                                                                                                                                                                                                                     
 dense_4 (Dense)                                                                  (None, 10, 128)                                        512                           ['decoder_inputs[0][0]']                                                           Y          
                                                                                                                                                                                                                                                                     
 dense (Dense)                                                                    (None, 25, 128)                                        384                           ['encoder_past_inputs[0][0]']                                                      Y          
                                                                                                                                                                                                                                                                     
 dropout_2 (Dropout)                                                              (None, 10, 128)                                        0                             ['dense_4[0][0]']                                                                  Y          
                                                                                                                                                                                                                                                                     
 dropout (Dropout)                                                                (None, 25, 128)                                        0                             ['dense[0][0]']                                                                    Y          
                                                                                                                                                                                                                                                                     
 TCN__decoder_input_1 (TCN)                                                       (None, 10, 128)                                        1188864                       ['dropout_2[0][0]']                                                                Y          
                                                                                                                                                                                                                                                                     
 TCN__encoder_input_1 (TCN)                                                       (None, 25, 128)                                        1188864                       ['dropout[0][0]']                                                                  Y          
                                                                                                                                                                                                                                                                     
 glu_with_addnorm_1 (GLU_with_ADDNORM)                                            (None, 10, 128)                                        49792                         ['dropout_2[0][0]',                                                                Y          
                                                                                                                                                                        'TCN__decoder_input_1[0][0]']                                                                
                                                                                                                                                                                                                                                                     
 glu_with_addnorm (GLU_with_ADDNORM)                                              (None, 25, 128)                                        49792                         ['dropout[0][0]',                                                                  Y          
                                                                                                                                                                        'TCN__encoder_input_1[0][0]']                                                                
                                                                                                                                                                                                                                                                     
 additive_attention (AdditiveAttention)                                           (None, 10, 128)                                        128                           ['glu_with_addnorm_1[0][0]',                                                       Y          
                                                                                                                                                                        'glu_with_addnorm[0][0]']                                                                    
                                                                                                                                                                                                                                                                     
 concatenate (Concatenate)                                                        (None, 10, 256)                                        0                             ['glu_with_addnorm_1[0][0]',                                                       Y          
                                                                                                                                                                        'additive_attention[0][0]']                                                                  
                                                                                                                                                                                                                                                                     
 dense_8 (Dense)                                                                  (None, 10, 128)                                        32896                         ['concatenate[0][0]']                                                              Y          
                                                                                                                                                                                                                                                                     
 glu_with_addnorm_2 (GLU_with_ADDNORM)                                            (None, 10, 128)                                        49792                         ['glu_with_addnorm_1[0][0]',                                                       Y          
                                                                                                                                                                        'dense_8[0][0]']                                                                             
                                                                                                                                                                                                                                                                     
 additive_attention_1 (AdditiveAttention)                                         (None, 10, 128)                                        128                           ['glu_with_addnorm_2[0][0]',                                                       Y          
                                                                                                                                                                        'glu_with_addnorm[0][0]']                                                                    
                                                                                                                                                                                                                                                                     
 concatenate_1 (Concatenate)                                                      (None, 10, 256)                                        0                             ['glu_with_addnorm_2[0][0]',                                                       Y          
                                                                                                                                                                        'additive_attention_1[0][0]']                                                                
                                                                                                                                                                                                                                                                     
 dense_12 (Dense)                                                                 (None, 10, 128)                                        32896                         ['concatenate_1[0][0]']                                                            Y          
                                                                                                                                                                                                                                                                     
 glu_with_addnorm_3 (GLU_with_ADDNORM)                                            (None, 10, 128)                                        49792                         ['glu_with_addnorm_2[0][0]',                                                       Y          
                                                                                                                                                                        'dense_12[0][0]']                                                                            
                                                                                                                                                                                                                                                                     
 additive_attention_2 (AdditiveAttention)                                         (None, 10, 128)                                        128                           ['glu_with_addnorm_3[0][0]',                                                       Y          
                                                                                                                                                                        'glu_with_addnorm[0][0]']                                                                    
                                                                                                                                                                                                                                                                     
 concatenate_2 (Concatenate)                                                      (None, 10, 256)                                        0                             ['glu_with_addnorm_3[0][0]',                                                       Y          
                                                                                                                                                                        'additive_attention_2[0][0]']                                                                
                                                                                                                                                                                                                                                                     
 dense_16 (Dense)                                                                 (None, 10, 128)                                        32896                         ['concatenate_2[0][0]']                                                            Y          
                                                                                                                                                                                                                                                                     
 glu_with_addnorm_4 (GLU_with_ADDNORM)                                            (None, 10, 128)                                        49792                         ['glu_with_addnorm_3[0][0]',                                                       Y          
                                                                                                                                                                        'dense_16[0][0]']                                                                            
                                                                                                                                                                                                                                                                     
 TCN__decoder_output_1 (TCN)                                                      (None, 10, 128)                                        1188864                       ['glu_with_addnorm_4[0][0]']                                                       Y          
                                                                                                                                                                                                                                                                     
 glu_with_addnorm_5 (GLU_with_ADDNORM)                                            (None, 10, 128)                                        49792                         ['glu_with_addnorm_4[0][0]',                                                       Y          
                                                                                                                                                                        'TCN__decoder_output_1[0][0]']                                                               
                                                                                                                                                                                                                                                                     
 time_distributed_19 (TimeDistributed)                                            (None, 10, 2)                                          258                           ['glu_with_addnorm_5[0][0]']                                                       Y          
                                                                                                                                                                                                                                                                     
 dense_25 (Dense)                                                                 (None, 10, 14)                                         42                            ['time_distributed_19[0][0]']                                                      Y          
                                                                                                                                                                                                                                                                     
 reshape (Reshape)                                                                (None, 10, 2, 7)                                       0                             ['dense_25[0][0]']                                                                 Y          
                                                                                                                                                                                                                                                                     
=====================================================================================================================================================================================================================================================================
Total params: 3,965,612
Trainable params: 3,965,612
Non-trainable params: 0
_____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
_________________________
Model size in GB : 0.020000