Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 encoder_past_inputs (InputLaye  [(None, 672, 31)]   0           []                               
 r)                                                                                               
                                                                                                  
 encoder_future_1_inputs (Input  [(None, 96, 10)]    0           []                               
 Layer)                                                                                           
                                                                                                  
 dense (Dense)                  (None, 672, 64)      2048        ['encoder_past_inputs[0][0]']    
                                                                                                  
 encoder_future_2_inputs (Input  [(None, 96, 10)]    0           []                               
 Layer)                                                                                           
                                                                                                  
 encoder_future_3_inputs (Input  [(None, 96, 10)]    0           []                               
 Layer)                                                                                           
                                                                                                  
 encoder_future_4_inputs (Input  [(None, 96, 10)]    0           []                               
 Layer)                                                                                           
                                                                                                  
 encoder_future_5_inputs (Input  [(None, 96, 10)]    0           []                               
 Layer)                                                                                           
                                                                                                  
 encoder_future_6_inputs (Input  [(None, 96, 10)]    0           []                               
 Layer)                                                                                           
                                                                                                  
 dense_1 (Dense)                (None, 96, 64)       704         ['encoder_future_1_inputs[0][0]']
                                                                                                  
 dropout (Dropout)              (None, 672, 64)      0           ['dense[0][0]']                  
                                                                                                  
 dense_4 (Dense)                (None, 96, 64)       704         ['encoder_future_2_inputs[0][0]']
                                                                                                  
 dense_7 (Dense)                (None, 96, 64)       704         ['encoder_future_3_inputs[0][0]']
                                                                                                  
 dense_10 (Dense)               (None, 96, 64)       704         ['encoder_future_4_inputs[0][0]']
                                                                                                  
 dense_13 (Dense)               (None, 96, 64)       704         ['encoder_future_5_inputs[0][0]']
                                                                                                  
 dense_16 (Dense)               (None, 96, 64)       704         ['encoder_future_6_inputs[0][0]']
                                                                                                  
 dropout_1 (Dropout)            (None, 96, 64)       0           ['dense_1[0][0]']                
                                                                                                  
 bidirectional (Bidirectional)  [(None, 672, 128),   49920       ['dropout[0][0]']                
                                 (None, 64),                                                      
                                 (None, 64)]                                                      
                                                                                                  
 dropout_2 (Dropout)            (None, 96, 64)       0           ['dense_4[0][0]']                
                                                                                                  
 dropout_3 (Dropout)            (None, 96, 64)       0           ['dense_7[0][0]']                
                                                                                                  
 dropout_4 (Dropout)            (None, 96, 64)       0           ['dense_10[0][0]']               
                                                                                                  
 dropout_5 (Dropout)            (None, 96, 64)       0           ['dense_13[0][0]']               
                                                                                                  
 dropout_6 (Dropout)            (None, 96, 64)       0           ['dense_16[0][0]']               
                                                                                                  
 bidirectional_1 (Bidirectional  [(None, 96, 128),   49920       ['dropout_1[0][0]',              
 )                               (None, 64),                      'bidirectional[0][1]',          
                                 (None, 64)]                      'bidirectional[0][2]']          
                                                                                                  
 bidirectional_3 (Bidirectional  [(None, 96, 128),   49920       ['dropout_2[0][0]',              
 )                               (None, 64),                      'bidirectional[0][1]',          
                                 (None, 64)]                      'bidirectional[0][2]']          
                                                                                                  
 bidirectional_5 (Bidirectional  [(None, 96, 128),   49920       ['dropout_3[0][0]',              
 )                               (None, 64),                      'bidirectional[0][1]',          
                                 (None, 64)]                      'bidirectional[0][2]']          
                                                                                                  
 bidirectional_7 (Bidirectional  [(None, 96, 128),   49920       ['dropout_4[0][0]',              
 )                               (None, 64),                      'bidirectional[0][1]',          
                                 (None, 64)]                      'bidirectional[0][2]']          
                                                                                                  
 bidirectional_9 (Bidirectional  [(None, 96, 128),   49920       ['dropout_5[0][0]',              
 )                               (None, 64),                      'bidirectional[0][1]',          
                                 (None, 64)]                      'bidirectional[0][2]']          
                                                                                                  
 bidirectional_11 (Bidirectiona  [(None, 96, 128),   49920       ['dropout_6[0][0]',              
 l)                              (None, 64),                      'bidirectional[0][1]',          
                                 (None, 64)]                      'bidirectional[0][2]']          
                                                                                                  
 encoder_future_1_selfMHA (Mult  (None, 96, 128)     127848      ['bidirectional_1[0][0]',        
 iHeadAttention)                                                  'bidirectional_1[0][0]',        
                                                                  'bidirectional_1[0][0]']        
                                                                                                  
 encoder_past_1_selfMHA (MultiH  (None, 672, 128)    127848      ['bidirectional[0][0]',          
 eadAttention)                                                    'bidirectional[0][0]',          
                                                                  'bidirectional[0][0]']          
                                                                                                  
 concatenate (Concatenate)      (None, 128)          0           ['bidirectional[0][1]',          
                                                                  'bidirectional_1[0][1]',        
                                                                  'bidirectional[0][2]',          
                                                                  'bidirectional_1[0][2]']        
                                                                                                  
 encoder_future_2_selfMHA (Mult  (None, 96, 128)     127848      ['bidirectional_3[0][0]',        
 iHeadAttention)                                                  'bidirectional_3[0][0]',        
                                                                  'bidirectional_3[0][0]']        
                                                                                                  
 concatenate_1 (Concatenate)    (None, 128)          0           ['bidirectional[0][1]',          
                                                                  'bidirectional_3[0][1]',        
                                                                  'bidirectional[0][2]',          
                                                                  'bidirectional_3[0][2]']        
                                                                                                  
 encoder_future_3_selfMHA (Mult  (None, 96, 128)     127848      ['bidirectional_5[0][0]',        
 iHeadAttention)                                                  'bidirectional_5[0][0]',        
                                                                  'bidirectional_5[0][0]']        
                                                                                                  
 concatenate_2 (Concatenate)    (None, 128)          0           ['bidirectional[0][1]',          
                                                                  'bidirectional_5[0][1]',        
                                                                  'bidirectional[0][2]',          
                                                                  'bidirectional_5[0][2]']        
                                                                                                  
 encoder_future_4_selfMHA (Mult  (None, 96, 128)     127848      ['bidirectional_7[0][0]',        
 iHeadAttention)                                                  'bidirectional_7[0][0]',        
                                                                  'bidirectional_7[0][0]']        
                                                                                                  
 concatenate_3 (Concatenate)    (None, 128)          0           ['bidirectional[0][1]',          
                                                                  'bidirectional_7[0][1]',        
                                                                  'bidirectional[0][2]',          
                                                                  'bidirectional_7[0][2]']        
                                                                                                  
 encoder_future_5_selfMHA (Mult  (None, 96, 128)     127848      ['bidirectional_9[0][0]',        
 iHeadAttention)                                                  'bidirectional_9[0][0]',        
                                                                  'bidirectional_9[0][0]']        
                                                                                                  
 concatenate_4 (Concatenate)    (None, 128)          0           ['bidirectional[0][1]',          
                                                                  'bidirectional_9[0][1]',        
                                                                  'bidirectional[0][2]',          
                                                                  'bidirectional_9[0][2]']        
                                                                                                  
 encoder_future_6_selfMHA (Mult  (None, 96, 128)     127848      ['bidirectional_11[0][0]',       
 iHeadAttention)                                                  'bidirectional_11[0][0]',       
                                                                  'bidirectional_11[0][0]']       
                                                                                                  
 concatenate_5 (Concatenate)    (None, 128)          0           ['bidirectional[0][1]',          
                                                                  'bidirectional_11[0][1]',       
                                                                  'bidirectional[0][2]',          
                                                                  'bidirectional_11[0][2]']       
                                                                                                  
 decoder_future_1_crossMHA (Mul  (None, 96, 128)     127848      ['encoder_future_1_selfMHA[0][0]'
 tiHeadAttention)                                                , 'encoder_past_1_selfMHA[0][0]',
                                                                  'encoder_past_1_selfMHA[0][0]'] 
                                                                                                  
 dense_2 (Dense)                (None, 64)           8256        ['concatenate[0][0]',            
                                                                  'concatenate[1][0]']            
                                                                                                  
 decoder_future_2_crossMHA (Mul  (None, 96, 128)     127848      ['encoder_future_2_selfMHA[0][0]'
 tiHeadAttention)                                                , 'encoder_past_1_selfMHA[0][0]',
                                                                  'encoder_past_1_selfMHA[0][0]'] 
                                                                                                  
 dense_5 (Dense)                (None, 64)           8256        ['concatenate_1[0][0]',          
                                                                  'concatenate_1[1][0]']          
                                                                                                  
 decoder_future_3_crossMHA (Mul  (None, 96, 128)     127848      ['encoder_future_3_selfMHA[0][0]'
 tiHeadAttention)                                                , 'encoder_past_1_selfMHA[0][0]',
                                                                  'encoder_past_1_selfMHA[0][0]'] 
                                                                                                  
 dense_8 (Dense)                (None, 64)           8256        ['concatenate_2[0][0]',          
                                                                  'concatenate_2[1][0]']          
                                                                                                  
 decoder_future_4_crossMHA (Mul  (None, 96, 128)     127848      ['encoder_future_4_selfMHA[0][0]'
 tiHeadAttention)                                                , 'encoder_past_1_selfMHA[0][0]',
                                                                  'encoder_past_1_selfMHA[0][0]'] 
                                                                                                  
 dense_11 (Dense)               (None, 64)           8256        ['concatenate_3[0][0]',          
                                                                  'concatenate_3[1][0]']          
                                                                                                  
 decoder_future_5_crossMHA (Mul  (None, 96, 128)     127848      ['encoder_future_5_selfMHA[0][0]'
 tiHeadAttention)                                                , 'encoder_past_1_selfMHA[0][0]',
                                                                  'encoder_past_1_selfMHA[0][0]'] 
                                                                                                  
 dense_14 (Dense)               (None, 64)           8256        ['concatenate_4[0][0]',          
                                                                  'concatenate_4[1][0]']          
                                                                                                  
 decoder_future_6_crossMHA (Mul  (None, 96, 128)     127848      ['encoder_future_6_selfMHA[0][0]'
 tiHeadAttention)                                                , 'encoder_past_1_selfMHA[0][0]',
                                                                  'encoder_past_1_selfMHA[0][0]'] 
                                                                                                  
 dense_17 (Dense)               (None, 64)           8256        ['concatenate_5[0][0]',          
                                                                  'concatenate_5[1][0]']          
                                                                                                  
 bidirectional_2 (Bidirectional  [(None, 96, 128),   74496       ['decoder_future_1_crossMHA[0][0]
 )                               (None, 64),                     ',                               
                                 (None, 64)]                      'dense_2[0][0]',                
                                                                  'dense_2[1][0]']                
                                                                                                  
 bidirectional_4 (Bidirectional  [(None, 96, 128),   74496       ['decoder_future_2_crossMHA[0][0]
 )                               (None, 64),                     ',                               
                                 (None, 64)]                      'dense_5[0][0]',                
                                                                  'dense_5[1][0]']                
                                                                                                  
 bidirectional_6 (Bidirectional  [(None, 96, 128),   74496       ['decoder_future_3_crossMHA[0][0]
 )                               (None, 64),                     ',                               
                                 (None, 64)]                      'dense_8[0][0]',                
                                                                  'dense_8[1][0]']                
                                                                                                  
 bidirectional_8 (Bidirectional  [(None, 96, 128),   74496       ['decoder_future_4_crossMHA[0][0]
 )                               (None, 64),                     ',                               
                                 (None, 64)]                      'dense_11[0][0]',               
                                                                  'dense_11[1][0]']               
                                                                                                  
 bidirectional_10 (Bidirectiona  [(None, 96, 128),   74496       ['decoder_future_5_crossMHA[0][0]
 l)                              (None, 64),                     ',                               
                                 (None, 64)]                      'dense_14[0][0]',               
                                                                  'dense_14[1][0]']               
                                                                                                  
 bidirectional_12 (Bidirectiona  [(None, 96, 128),   74496       ['decoder_future_6_crossMHA[0][0]
 l)                              (None, 64),                     ',                               
                                 (None, 64)]                      'dense_17[0][0]',               
                                                                  'dense_17[1][0]']               
                                                                                                  
 time_distributed (TimeDistribu  (None, 96, 1)       129         ['bidirectional_2[0][0]']        
 ted)                                                                                             
                                                                                                  
 time_distributed_1 (TimeDistri  (None, 96, 1)       129         ['bidirectional_4[0][0]']        
 buted)                                                                                           
                                                                                                  
 time_distributed_2 (TimeDistri  (None, 96, 1)       129         ['bidirectional_6[0][0]']        
 buted)                                                                                           
                                                                                                  
 time_distributed_3 (TimeDistri  (None, 96, 1)       129         ['bidirectional_8[0][0]']        
 buted)                                                                                           
                                                                                                  
 time_distributed_4 (TimeDistri  (None, 96, 1)       129         ['bidirectional_10[0][0]']       
 buted)                                                                                           
                                                                                                  
 time_distributed_5 (TimeDistri  (None, 96, 1)       129         ['bidirectional_12[0][0]']       
 buted)                                                                                           
                                                                                                  
 concatenate_6 (Concatenate)    (None, 96, 6)        0           ['time_distributed[0][0]',       
                                                                  'time_distributed_1[0][0]',     
                                                                  'time_distributed_2[0][0]',     
                                                                  'time_distributed_3[0][0]',     
                                                                  'time_distributed_4[0][0]',     
                                                                  'time_distributed_5[0][0]']     
                                                                                                  
 dense_19 (Dense)               (None, 96, 3)        21          ['concatenate_6[0][0]']          
                                                                                                  
 dense_20 (Dense)               (None, 96, 1)        4           ['dense_19[0][0]']               
                                                                                                  
 dense_21 (Dense)               (None, 96, 7)        14          ['dense_20[0][0]']               
                                                                                                  
 reshape (Reshape)              (None, 96, 1, 7)     0           ['dense_21[0][0]']               
                                                                                                  
==================================================================================================
Total params: 2,515,061
Trainable params: 2,515,061
Non-trainable params: 0
__________________________________________________________________________________________________
