Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 encoder_past_inputs (InputLaye  [(None, 672, 31)]   0           []                               
 r)                                                                                               
                                                                                                  
 dense (Dense)                  (None, 672, 64)      2048        ['encoder_past_inputs[0][0]']    
                                                                                                  
 dropout (Dropout)              (None, 672, 64)      0           ['dense[0][0]']                  
                                                                                                  
 decoder_1_inputs (InputLayer)  [(None, 96, 10)]     0           []                               
                                                                                                  
 bidirectional (Bidirectional)  (None, 672, 32)      7872        ['dropout[0][0]']                
                                                                                                  
 decoder_2_inputs (InputLayer)  [(None, 96, 10)]     0           []                               
                                                                                                  
 decoder_3_inputs (InputLayer)  [(None, 96, 10)]     0           []                               
                                                                                                  
 decoder_4_inputs (InputLayer)  [(None, 96, 10)]     0           []                               
                                                                                                  
 decoder_5_inputs (InputLayer)  [(None, 96, 10)]     0           []                               
                                                                                                  
 decoder_6_inputs (InputLayer)  [(None, 96, 10)]     0           []                               
                                                                                                  
 dense_1 (Dense)                (None, 96, 64)       704         ['decoder_1_inputs[0][0]']       
                                                                                                  
 bidirectional_1 (Bidirectional  (None, 672, 32)     4800        ['bidirectional[0][0]']          
 )                                                                                                
                                                                                                  
 dense_4 (Dense)                (None, 96, 64)       704         ['decoder_2_inputs[0][0]']       
                                                                                                  
 dense_7 (Dense)                (None, 96, 64)       704         ['decoder_3_inputs[0][0]']       
                                                                                                  
 dense_10 (Dense)               (None, 96, 64)       704         ['decoder_4_inputs[0][0]']       
                                                                                                  
 dense_13 (Dense)               (None, 96, 64)       704         ['decoder_5_inputs[0][0]']       
                                                                                                  
 dense_16 (Dense)               (None, 96, 64)       704         ['decoder_6_inputs[0][0]']       
                                                                                                  
 dropout_1 (Dropout)            (None, 96, 64)       0           ['dense_1[0][0]']                
                                                                                                  
 bidirectional_2 (Bidirectional  [(None, 672, 32),   4800        ['bidirectional_1[0][0]']        
 )                               (None, 16),                                                      
                                 (None, 16)]                                                      
                                                                                                  
 dropout_2 (Dropout)            (None, 96, 64)       0           ['dense_4[0][0]']                
                                                                                                  
 dropout_3 (Dropout)            (None, 96, 64)       0           ['dense_7[0][0]']                
                                                                                                  
 dropout_4 (Dropout)            (None, 96, 64)       0           ['dense_10[0][0]']               
                                                                                                  
 dropout_5 (Dropout)            (None, 96, 64)       0           ['dense_13[0][0]']               
                                                                                                  
 dropout_6 (Dropout)            (None, 96, 64)       0           ['dense_16[0][0]']               
                                                                                                  
 bidirectional_3 (Bidirectional  (None, 96, 32)      7872        ['dropout_1[0][0]',              
 )                                                                'bidirectional_2[0][1]',        
                                                                  'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_9 (Bidirectional  (None, 96, 32)      7872        ['dropout_2[0][0]',              
 )                                                                'bidirectional_2[0][1]',        
                                                                  'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_15 (Bidirectiona  (None, 96, 32)      7872        ['dropout_3[0][0]',              
 l)                                                               'bidirectional_2[0][1]',        
                                                                  'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_21 (Bidirectiona  (None, 96, 32)      7872        ['dropout_4[0][0]',              
 l)                                                               'bidirectional_2[0][1]',        
                                                                  'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_27 (Bidirectiona  (None, 96, 32)      7872        ['dropout_5[0][0]',              
 l)                                                               'bidirectional_2[0][1]',        
                                                                  'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_33 (Bidirectiona  (None, 96, 32)      7872        ['dropout_6[0][0]',              
 l)                                                               'bidirectional_2[0][1]',        
                                                                  'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_4 (Bidirectional  (None, 96, 32)      4800        ['bidirectional_3[0][0]',        
 )                                                                'bidirectional_2[0][1]',        
                                                                  'bidirectional_2[0][2]']        
                                                                                                  
 encoder_1_selfMHA-1 (MultiHead  (None, 672, 32)     32520       ['bidirectional_2[0][0]',        
 Attention)                                                       'bidirectional_2[0][0]',        
                                                                  'bidirectional_2[0][0]']        
                                                                                                  
 bidirectional_10 (Bidirectiona  (None, 96, 32)      4800        ['bidirectional_9[0][0]',        
 l)                                                               'bidirectional_2[0][1]',        
                                                                  'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_16 (Bidirectiona  (None, 96, 32)      4800        ['bidirectional_15[0][0]',       
 l)                                                               'bidirectional_2[0][1]',        
                                                                  'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_22 (Bidirectiona  (None, 96, 32)      4800        ['bidirectional_21[0][0]',       
 l)                                                               'bidirectional_2[0][1]',        
                                                                  'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_28 (Bidirectiona  (None, 96, 32)      4800        ['bidirectional_27[0][0]',       
 l)                                                               'bidirectional_2[0][1]',        
                                                                  'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_34 (Bidirectiona  (None, 96, 32)      4800        ['bidirectional_33[0][0]',       
 l)                                                               'bidirectional_2[0][1]',        
                                                                  'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_5 (Bidirectional  [(None, 96, 32),    4800        ['bidirectional_4[0][0]',        
 )                               (None, 16),                      'bidirectional_2[0][1]',        
                                 (None, 16)]                      'bidirectional_2[0][2]']        
                                                                                                  
 encoder_1_selfMHA-2 (MultiHead  (None, 672, 32)     32520       ['encoder_1_selfMHA-1[0][0]',    
 Attention)                                                       'encoder_1_selfMHA-1[0][0]',    
                                                                  'encoder_1_selfMHA-1[0][0]']    
                                                                                                  
 bidirectional_11 (Bidirectiona  [(None, 96, 32),    4800        ['bidirectional_10[0][0]',       
 l)                              (None, 16),                      'bidirectional_2[0][1]',        
                                 (None, 16)]                      'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_17 (Bidirectiona  [(None, 96, 32),    4800        ['bidirectional_16[0][0]',       
 l)                              (None, 16),                      'bidirectional_2[0][1]',        
                                 (None, 16)]                      'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_23 (Bidirectiona  [(None, 96, 32),    4800        ['bidirectional_22[0][0]',       
 l)                              (None, 16),                      'bidirectional_2[0][1]',        
                                 (None, 16)]                      'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_29 (Bidirectiona  [(None, 96, 32),    4800        ['bidirectional_28[0][0]',       
 l)                              (None, 16),                      'bidirectional_2[0][1]',        
                                 (None, 16)]                      'bidirectional_2[0][2]']        
                                                                                                  
 bidirectional_35 (Bidirectiona  [(None, 96, 32),    4800        ['bidirectional_34[0][0]',       
 l)                              (None, 16),                      'bidirectional_2[0][1]',        
                                 (None, 16)]                      'bidirectional_2[0][2]']        
                                                                                                  
 decoder_1_casualMHA-1 (MultiHe  (None, 96, 32)      32520       ['bidirectional_5[0][0]',        
 adAttention)                                                     'bidirectional_5[0][0]',        
                                                                  'bidirectional_5[0][0]']        
                                                                                                  
 encoder_1_selfMHA-3 (MultiHead  (None, 672, 32)     32520       ['encoder_1_selfMHA-2[0][0]',    
 Attention)                                                       'encoder_1_selfMHA-2[0][0]',    
                                                                  'encoder_1_selfMHA-2[0][0]']    
                                                                                                  
 concatenate (Concatenate)      (None, 32)           0           ['bidirectional_2[0][1]',        
                                                                  'bidirectional_5[0][1]',        
                                                                  'bidirectional_2[0][2]',        
                                                                  'bidirectional_5[0][2]']        
                                                                                                  
 decoder_2_casualMHA-1 (MultiHe  (None, 96, 32)      32520       ['bidirectional_11[0][0]',       
 adAttention)                                                     'bidirectional_11[0][0]',       
                                                                  'bidirectional_11[0][0]']       
                                                                                                  
 concatenate_1 (Concatenate)    (None, 32)           0           ['bidirectional_2[0][1]',        
                                                                  'bidirectional_11[0][1]',       
                                                                  'bidirectional_2[0][2]',        
                                                                  'bidirectional_11[0][2]']       
                                                                                                  
 decoder_3_casualMHA-1 (MultiHe  (None, 96, 32)      32520       ['bidirectional_17[0][0]',       
 adAttention)                                                     'bidirectional_17[0][0]',       
                                                                  'bidirectional_17[0][0]']       
                                                                                                  
 concatenate_2 (Concatenate)    (None, 32)           0           ['bidirectional_2[0][1]',        
                                                                  'bidirectional_17[0][1]',       
                                                                  'bidirectional_2[0][2]',        
                                                                  'bidirectional_17[0][2]']       
                                                                                                  
 decoder_4_casualMHA-1 (MultiHe  (None, 96, 32)      32520       ['bidirectional_23[0][0]',       
 adAttention)                                                     'bidirectional_23[0][0]',       
                                                                  'bidirectional_23[0][0]']       
                                                                                                  
 concatenate_3 (Concatenate)    (None, 32)           0           ['bidirectional_2[0][1]',        
                                                                  'bidirectional_23[0][1]',       
                                                                  'bidirectional_2[0][2]',        
                                                                  'bidirectional_23[0][2]']       
                                                                                                  
 decoder_5_casualMHA-1 (MultiHe  (None, 96, 32)      32520       ['bidirectional_29[0][0]',       
 adAttention)                                                     'bidirectional_29[0][0]',       
                                                                  'bidirectional_29[0][0]']       
                                                                                                  
 concatenate_4 (Concatenate)    (None, 32)           0           ['bidirectional_2[0][1]',        
                                                                  'bidirectional_29[0][1]',       
                                                                  'bidirectional_2[0][2]',        
                                                                  'bidirectional_29[0][2]']       
                                                                                                  
 decoder_6_casualMHA-1 (MultiHe  (None, 96, 32)      32520       ['bidirectional_35[0][0]',       
 adAttention)                                                     'bidirectional_35[0][0]',       
                                                                  'bidirectional_35[0][0]']       
                                                                                                  
 concatenate_5 (Concatenate)    (None, 32)           0           ['bidirectional_2[0][1]',        
                                                                  'bidirectional_35[0][1]',       
                                                                  'bidirectional_2[0][2]',        
                                                                  'bidirectional_35[0][2]']       
                                                                                                  
 decoder_1_crossMHA-1 (MultiHea  (None, 96, 32)      32520       ['decoder_1_casualMHA-1[0][0]',  
 dAttention)                                                      'encoder_1_selfMHA-3[0][0]',    
                                                                  'encoder_1_selfMHA-3[0][0]']    
                                                                                                  
 dense_2 (Dense)                (None, 16)           528         ['concatenate[0][0]',            
                                                                  'concatenate[1][0]']            
                                                                                                  
 decoder_2_crossMHA-1 (MultiHea  (None, 96, 32)      32520       ['decoder_2_casualMHA-1[0][0]',  
 dAttention)                                                      'encoder_1_selfMHA-3[0][0]',    
                                                                  'encoder_1_selfMHA-3[0][0]']    
                                                                                                  
 dense_5 (Dense)                (None, 16)           528         ['concatenate_1[0][0]',          
                                                                  'concatenate_1[1][0]']          
                                                                                                  
 decoder_3_crossMHA-1 (MultiHea  (None, 96, 32)      32520       ['decoder_3_casualMHA-1[0][0]',  
 dAttention)                                                      'encoder_1_selfMHA-3[0][0]',    
                                                                  'encoder_1_selfMHA-3[0][0]']    
                                                                                                  
 dense_8 (Dense)                (None, 16)           528         ['concatenate_2[0][0]',          
                                                                  'concatenate_2[1][0]']          
                                                                                                  
 decoder_4_crossMHA-1 (MultiHea  (None, 96, 32)      32520       ['decoder_4_casualMHA-1[0][0]',  
 dAttention)                                                      'encoder_1_selfMHA-3[0][0]',    
                                                                  'encoder_1_selfMHA-3[0][0]']    
                                                                                                  
 dense_11 (Dense)               (None, 16)           528         ['concatenate_3[0][0]',          
                                                                  'concatenate_3[1][0]']          
                                                                                                  
 decoder_5_crossMHA-1 (MultiHea  (None, 96, 32)      32520       ['decoder_5_casualMHA-1[0][0]',  
 dAttention)                                                      'encoder_1_selfMHA-3[0][0]',    
                                                                  'encoder_1_selfMHA-3[0][0]']    
                                                                                                  
 dense_14 (Dense)               (None, 16)           528         ['concatenate_4[0][0]',          
                                                                  'concatenate_4[1][0]']          
                                                                                                  
 decoder_6_crossMHA-1 (MultiHea  (None, 96, 32)      32520       ['decoder_6_casualMHA-1[0][0]',  
 dAttention)                                                      'encoder_1_selfMHA-3[0][0]',    
                                                                  'encoder_1_selfMHA-3[0][0]']    
                                                                                                  
 dense_17 (Dense)               (None, 16)           528         ['concatenate_5[0][0]',          
                                                                  'concatenate_5[1][0]']          
                                                                                                  
 bidirectional_6 (Bidirectional  (None, 96, 32)      4800        ['decoder_1_crossMHA-1[0][0]',   
 )                                                                'dense_2[0][0]',                
                                                                  'dense_2[1][0]']                
                                                                                                  
 bidirectional_12 (Bidirectiona  (None, 96, 32)      4800        ['decoder_2_crossMHA-1[0][0]',   
 l)                                                               'dense_5[0][0]',                
                                                                  'dense_5[1][0]']                
                                                                                                  
 bidirectional_18 (Bidirectiona  (None, 96, 32)      4800        ['decoder_3_crossMHA-1[0][0]',   
 l)                                                               'dense_8[0][0]',                
                                                                  'dense_8[1][0]']                
                                                                                                  
 bidirectional_24 (Bidirectiona  (None, 96, 32)      4800        ['decoder_4_crossMHA-1[0][0]',   
 l)                                                               'dense_11[0][0]',               
                                                                  'dense_11[1][0]']               
                                                                                                  
 bidirectional_30 (Bidirectiona  (None, 96, 32)      4800        ['decoder_5_crossMHA-1[0][0]',   
 l)                                                               'dense_14[0][0]',               
                                                                  'dense_14[1][0]']               
                                                                                                  
 bidirectional_36 (Bidirectiona  (None, 96, 32)      4800        ['decoder_6_crossMHA-1[0][0]',   
 l)                                                               'dense_17[0][0]',               
                                                                  'dense_17[1][0]']               
                                                                                                  
 bidirectional_7 (Bidirectional  (None, 96, 32)      4800        ['bidirectional_6[0][0]',        
 )                                                                'dense_2[0][0]',                
                                                                  'dense_2[1][0]']                
                                                                                                  
 bidirectional_13 (Bidirectiona  (None, 96, 32)      4800        ['bidirectional_12[0][0]',       
 l)                                                               'dense_5[0][0]',                
                                                                  'dense_5[1][0]']                
                                                                                                  
 bidirectional_19 (Bidirectiona  (None, 96, 32)      4800        ['bidirectional_18[0][0]',       
 l)                                                               'dense_8[0][0]',                
                                                                  'dense_8[1][0]']                
                                                                                                  
 bidirectional_25 (Bidirectiona  (None, 96, 32)      4800        ['bidirectional_24[0][0]',       
 l)                                                               'dense_11[0][0]',               
                                                                  'dense_11[1][0]']               
                                                                                                  
 bidirectional_31 (Bidirectiona  (None, 96, 32)      4800        ['bidirectional_30[0][0]',       
 l)                                                               'dense_14[0][0]',               
                                                                  'dense_14[1][0]']               
                                                                                                  
 bidirectional_37 (Bidirectiona  (None, 96, 32)      4800        ['bidirectional_36[0][0]',       
 l)                                                               'dense_17[0][0]',               
                                                                  'dense_17[1][0]']               
                                                                                                  
 bidirectional_8 (Bidirectional  [(None, 96, 32),    4800        ['bidirectional_7[0][0]',        
 )                               (None, 16),                      'dense_2[0][0]',                
                                 (None, 16)]                      'dense_2[1][0]']                
                                                                                                  
 bidirectional_14 (Bidirectiona  [(None, 96, 32),    4800        ['bidirectional_13[0][0]',       
 l)                              (None, 16),                      'dense_5[0][0]',                
                                 (None, 16)]                      'dense_5[1][0]']                
                                                                                                  
 bidirectional_20 (Bidirectiona  [(None, 96, 32),    4800        ['bidirectional_19[0][0]',       
 l)                              (None, 16),                      'dense_8[0][0]',                
                                 (None, 16)]                      'dense_8[1][0]']                
                                                                                                  
 bidirectional_26 (Bidirectiona  [(None, 96, 32),    4800        ['bidirectional_25[0][0]',       
 l)                              (None, 16),                      'dense_11[0][0]',               
                                 (None, 16)]                      'dense_11[1][0]']               
                                                                                                  
 bidirectional_32 (Bidirectiona  [(None, 96, 32),    4800        ['bidirectional_31[0][0]',       
 l)                              (None, 16),                      'dense_14[0][0]',               
                                 (None, 16)]                      'dense_14[1][0]']               
                                                                                                  
 bidirectional_38 (Bidirectiona  [(None, 96, 32),    4800        ['bidirectional_37[0][0]',       
 l)                              (None, 16),                      'dense_17[0][0]',               
                                 (None, 16)]                      'dense_17[1][0]']               
                                                                                                  
 time_distributed (TimeDistribu  (None, 96, 1)       33          ['bidirectional_8[0][0]']        
 ted)                                                                                             
                                                                                                  
 time_distributed_1 (TimeDistri  (None, 96, 1)       33          ['bidirectional_14[0][0]']       
 buted)                                                                                           
                                                                                                  
 time_distributed_2 (TimeDistri  (None, 96, 1)       33          ['bidirectional_20[0][0]']       
 buted)                                                                                           
                                                                                                  
 time_distributed_3 (TimeDistri  (None, 96, 1)       33          ['bidirectional_26[0][0]']       
 buted)                                                                                           
                                                                                                  
 time_distributed_4 (TimeDistri  (None, 96, 1)       33          ['bidirectional_32[0][0]']       
 buted)                                                                                           
                                                                                                  
 time_distributed_5 (TimeDistri  (None, 96, 1)       33          ['bidirectional_38[0][0]']       
 buted)                                                                                           
                                                                                                  
 concatenate_6 (Concatenate)    (None, 96, 6)        0           ['time_distributed[0][0]',       
                                                                  'time_distributed_1[0][0]',     
                                                                  'time_distributed_2[0][0]',     
                                                                  'time_distributed_3[0][0]',     
                                                                  'time_distributed_4[0][0]',     
                                                                  'time_distributed_5[0][0]']     
                                                                                                  
 dense_19 (Dense)               (None, 96, 3)        21          ['concatenate_6[0][0]']          
                                                                                                  
 dense_20 (Dense)               (None, 96, 1)        4           ['dense_19[0][0]']               
                                                                                                  
 dense_21 (Dense)               (None, 96, 7)        14          ['dense_20[0][0]']               
                                                                                                  
 reshape (Reshape)              (None, 96, 1, 7)     0           ['dense_21[0][0]']               
                                                                                                  
==================================================================================================
Total params: 706,181
Trainable params: 706,181
Non-trainable params: 0
__________________________________________________________________________________________________
